ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
/**
***************************************************************************
* @addtogroup Tasks
* @{
* @file         system_task.c
* @author       ADI
* @version      V1.0.0
* @date         16-June-2016
* @brief        Source file contains system process for wearable device
*framework.
***************************************************************************
* @attention
***************************************************************************
*/
/*!
*  \copyright Analog Devices
* ****************************************************************************
*
* License Agreement
*
* Copyright (c) 2019 Analog Devices Inc.
* All rights reserved.
*
* This source code is intended for the recipient only under the guidelines of
* the non-disclosure agreement with Analog Devices Inc.
*

* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
* EXPRESS OR  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
* IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
* CLAIM, DAMAGES OR OTHER  LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
* TORT OR OTHERWISE, ARISING  FROM, OUT OF OR IN CONNECTION WITH THE
* SOFTWARE OR THE USE OR OTHER  DEALINGS IN THE SOFTWARE.
* ****************************************************************************
*/

/*---------------------------- Includes --------------------------------------*/
#include "file_system_utils.h"
#include "light_fs.h"
#include <dcb_interface.h>
#include <file_system_interface.h>
#include <file_system_task.h>
#include <includes.h>
#include <system_interface.h>
#include <system_task.h>
#include <system_version.h>
#include <task_includes.h>

#include "Adxl362.h"
#include "ad5940.h"
#include "ad7156.h"
#include "ad7156_dcfg.h"
#include "adp5360.h"
#include "adpd4000_buffering.h"
#include "adpd4000_dcfg.h"
#include "bcm_application_task.h"
#include "adxl_dcfg.h"
#include "app_timer.h"
#include "ble_gap.h"
#include "ble_task.h"
#include "dcb_general_block.h"
#include "lt_app_lcfg_block.h"
#include "fds_drv.h"
#include "file_system_utils.h"
#include "mw_ppg.h"
#include "power_manager.h"
#include "rtc.h"
#include "sensor_ad5940.h"
#include "timers.h"
#include "touch_test.h"
#include "us_tick.h"
#include <adpd4000_task.h>
#include "display_app.h"
#include "manufacture_date.h"
/* System Task Module Log settings */
#define NRF_LOG_MODULE_NAME System_Task

#if SYSTEM_TASK_CONFIG_LOG_ENABLED
#ifdef NRF_LOG_DEFAULT_LEVEL
#undef NRF_LOG_DEFAULT_LEVEL
#define NRF_LOG_DEFAULT_LEVEL SYSTEM_TASK_CONFIG_LOG_LEVEL
#endif
#define NRF_LOG_INFO_COLOR SYSTEM_TASK_CONFIG_INFO_COLOR
#define NRF_LOG_DEBUG_COLOR SYSTEM_TASK_CONFIG_DEBUG_COLOR
#else // SYSTEM_TASK_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL 0
#endif // SYSTEM_TASK_CONFIG_LOG_ENABLED

#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

/*------------------------------ Private Function Prototype ---------------- */
static void system_task(void *pArgument);
static void StreamBatt_Info(void);

/*------------------------------ Public Function Prototype ------------------ */
extern void trigger_nRF_MCU_hw_reset();
extern uint32_t ad5940_port_Init(void);
extern uint32_t ad5940_port_deInit(void);
extern bool ecg_get_dcb_present_flag(void);
extern bool eda_get_dcb_present_flag(void);
extern void delete_low_touch_config_file();
extern void load_default_low_touch_config();
/* For system FreeRTOS Task Creation */
/* Create the stack for task */
uint8_t ga_system_task_stack[APP_OS_CFG_PM_TASK_STK_SIZE];
/* Create handler for task */
ADI_OSAL_THREAD_HANDLE gh_system_task_handler;
/* Create task attributes variable */
ADI_OSAL_STATIC_THREAD_ATTR g_system_task_attributes;
/* Create TCB for task */
StaticTask_t g_system_task_tcb;
/* Create Queue Handler for task */
ADI_OSAL_QUEUE_HANDLE gh_system_task_msg_queue = NULL;
// ADI_OSAL_SEM_HANDLE   g_sys_task_evt_sem;

/* Structure to hold system info */
m2m2_pm_sys_info_t g_system_info = {
    (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_PM_SYS_COMMAND_GET_INFO_RESP,
    (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_OK,
    0x0000,                               // version number
    {0x00, 0xE0, 0x22, 0xF0, 0xF1, 0xF2}, // MAC address
    0x00000000,                           // device id
    0x00000000,                           // model number
    0x0000,                               // hw_id
    0x0000,                               // bom_id
    0x00,                                 // batch_id
    0x00000000};                          // date

/*default value for battery-low level alert  */
#define DEFAULT_BATTERY_LEVEL_LOW 5U

/*default value for battery-critical level alert  */
#define DEFAULT_BATTERY_LEVEL_CRITICAL 1U

/*Structure to hold battery notifications related information*/
struct battery_level_alerts_ {
  uint8_t level_low;           /*Battery low level threshold*/
  uint8_t level_critical;      /*Battery critical level threshold*/
  uint8_t critical_level_flag; /*Battery critical level flag*/
  M2M2_ADDR_ENUM_t
      tool_addr; /*Destination address for battery notifications alerts*/
} battery_level_alerts;

static uint32_t BattInfoChecksum = 0;
// static uint8_t  BatteryLevelCritical = 5;
// static uint8_t  BatteryLevelLow = 15;
// static uint8_t  gsLogBatteryCriticalFlag = 0;

/*Indicate the availability of config file in the NAND flash*/
volatile uint8_t gsCfgFileFoundFlag = 0;
#ifdef LOW_TOUCH_FEATURE
#include <low_touch_task.h>
/*Indicate the availability of gen blk DCB config for low touch*/
static volatile uint8_t gbDCBCfgFoundFlag = 0;
#endif
static uint16_t BattInfoSubsciberCount = 0;

/*Ping Test Initial Values*/
static uint16_t ping_count = 10;
static uint8_t ping_pkt_sz = 70;
static M2M2_ADDR_ENUM_t ping_pkt_src;
static void ping_timer_init(void);
static void ping_timer_start(void);
static void ping_timer_stop(void);

#ifdef DCB
static m2m2_hdr_t *lt_app_lcfg_dcb_command_read_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *lt_app_lcfg_dcb_command_write_config(m2m2_hdr_t *p_pkt);
static m2m2_hdr_t *lt_app_lcfg_dcb_command_delete_config(m2m2_hdr_t *p_pkt);
#endif

