ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
  gsCfgFileSummaryPkt =
      (m2m2_file_sys_user_cfg_summary_pkt_t *)&gsConfigTmpFile_ptr[M2M2_HEADER_SZ];

  if (nStart) {
    gsStartCmdsRunning = 1;
    gsStopCmdsRunning = 0;
    gsConfigFileHeadPtr =
        &gsConfigTmpFile_ptr[CONFIG_FILE_SUMMARY_PKT_SIZE]; // Load the start cmds
                                                        // starting point
    gsConfigFileSize =
        gsCfgFileSummaryPkt->start_cmd_len; // start commands end point
  } else {
    gsStopCmdsRunning = 1;
    gsStartCmdsRunning = 0;
    // Load the stop cmds starting point
    gsConfigFileHeadPtr = &gsConfigTmpFile_ptr[CONFIG_FILE_SUMMARY_PKT_SIZE +
                                           gsCfgFileSummaryPkt->start_cmd_len];
    gsConfigFileSize =
        gsCfgFileSummaryPkt->stop_cmd_len; // stop commands end point
  }
  gsNumOfCommands = 0;
  gsStartStatusCnt = 0;
  gsSubStatusCnt = 0;
  gsfslogStatusCnt = 0;
  gsCommonStatusCnt = 0;

  gsConfigFileReadPtr = gsConfigFileHeadPtr;
  gsConfigFileTailPtr = gsConfigFileHeadPtr + (gsConfigFileSize - 1);
  gsSendNextConfigCmd = 1; // start sending config commands
}

/*!
 ****************************************************************************
 * @brief   Initiates the commmand to stop the low-touch logs and also to stop
 * the sensors
 * @param    None
 * @retval   None
 ******************************************************************************/
void StopLowTouchLogging() {
  m2m2_hdr_t *response_mail = NULL;
  ADI_OSAL_STATUS err;

  response_mail =
      post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_cmd_t));
  if (response_mail != NULL) {
    m2m2_file_sys_cmd_t *stop_low_touch_log_req =
        (m2m2_file_sys_cmd_t *)&response_mail->data[0];

    /* send response packet */
    response_mail->src = low_touch_info.tool_addr;
    response_mail->dest = M2M2_ADDR_SYS_PM;
    response_mail->length = 10;
    response_mail->checksum = 0x0000;
    stop_low_touch_log_req->command =
        M2M2_PM_SYS_COMMAND_DISABLE_USER_CONFIG_LOG_REQ;
    stop_low_touch_log_req->status = M2M2_APP_COMMON_STATUS_OK;
    //              file_sys_get_config_req->file_name = M2M2_PM_SYS_MCU_M3;
    post_office_send(response_mail, &err);
  }
}

/*!
 ****************************************************************************
 * @brief   Send Force stop logging request to the fs-task
 * @param    None
 * @retval   None
 ******************************************************************************/
void SendForceStopLogging() {
#ifdef USE_FS
  m2m2_hdr_t *pkt = NULL;
  ADI_OSAL_STATUS err;
  /* If File logging is in progress */
  //        if (fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS) {
  /* Force Stop Logging */
  pkt = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
  if (pkt != NULL) {
    _m2m2_app_common_cmd_t *payload = (_m2m2_app_common_cmd_t *)&pkt->data[0];
    payload->command =
        (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_FORCE_STOP_LOG_REQ;
    pkt->src = M2M2_ADDR_SYS_PM;
    pkt->dest = M2M2_ADDR_SYS_FS;
    post_office_send(pkt, &err);
  }
//        }
#endif // USE_FS
}

/*!
 ****************************************************************************
 * @brief   Set the flag with NAND cfg file availablity status
 * @param    None
 * @retval   None
 ******************************************************************************/
void SetCfgFileAvailableFlag(uint8_t nflag) { gsCfgFileFoundFlag = nflag; }

/*!
 ****************************************************************************
 * @brief   Get the flag with NAND cfg file availablity status
 * @param    None
 * @retval   None
 ******************************************************************************/
uint8_t GetCfgFileAvailableFlag(void) { return(gsCfgFileFoundFlag); }

/*!
 ****************************************************************************
 * @brief   Set the flag with status of RAM buffer availability for DCB/NAND
 * cfg file
 * @param    None
 * @retval   None
 ******************************************************************************/
void SetCfgCopyAvailableFlag(uint8_t nflag) { gsCfgCopyAvailable = nflag; }

/*!
 ****************************************************************************
 * @brief   Return the flag with status of RAM buffer availability for DCB/NAND
 * cfg file
 * @param    None
 * @retval   None
 ******************************************************************************/
static uint8_t IsCfgCopyAvailable() { return (gsCfgCopyAvailable); }

/*!
 ****************************************************************************
 * @brief   Return the flag with status of gen_blk DCB availability with LT
 * configs
 * @param    None
 * @retval   None
 ******************************************************************************/
void find_low_touch_DCB() {
  gbDCBCfgFoundFlag = gen_blk_get_dcb_present_flag();
}

/*!
 ****************************************************************************
 * @brief   Function to send m2m2 cmd to get FS vol info
 * @param    None
 * @retval   None
 ******************************************************************************/
void GetVolInfo() {
  m2m2_hdr_t *pkt = NULL;
  ADI_OSAL_STATUS err;

  pkt = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
  if (pkt != NULL) {
    _m2m2_app_common_cmd_t *payload = (_m2m2_app_common_cmd_t *)&pkt->data[0];
    payload->command =
        (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_VOL_INFO_REQ;
    pkt->src = M2M2_ADDR_SYS_PM;
    pkt->dest = M2M2_ADDR_SYS_FS;
    post_office_send(pkt, &err);
  }
}

/*!
 ****************************************************************************
 * @brief   Function to send m2m2 cmd to get FS file count info
 * @param    None
 * @retval   None
 ******************************************************************************/
void GetFileCount() {
  m2m2_hdr_t *pkt = NULL;
  ADI_OSAL_STATUS err;

  pkt = post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
  if (pkt != NULL) {
    _m2m2_app_common_cmd_t *payload = (_m2m2_app_common_cmd_t *)&pkt->data[0];
    payload->command =
        (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_FILE_SYS_CMD_GET_NUMBER_OF_FILE_REQ;
    pkt->src = M2M2_ADDR_SYS_PM;
    pkt->dest = M2M2_ADDR_SYS_FS;
    post_office_send(pkt, &err);
  }
}

/*!
 ****************************************************************************
 * @brief   Sends the battery critical info to the tool if registerd during low
 * touch logging
 * @param    None
 * @retval   None
 ******************************************************************************/
static void SendBatteryCriticalErrResp() {
  m2m2_hdr_t *response_mail = NULL;
  ADI_OSAL_STATUS err;

