ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
  if (low_touch_info.tool_addr != M2M2_ADDR_UNDEFINED) {
    response_mail =
        post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_cmd_t));
    if (response_mail != NULL) {
      m2m2_pm_sys_cmd_t *low_touch_resp =
          (m2m2_pm_sys_cmd_t *)&response_mail->data[0];

      /* send response packet */
      response_mail->src = M2M2_ADDR_SYS_PM;
      response_mail->dest = (M2M2_ADDR_ENUM_t)low_touch_info.tool_addr;
      response_mail->length = 10;
      response_mail->checksum = 0x0000;
      low_touch_resp->command =
          M2M2_FILE_SYS_CMD_FORCE_STOP_LOG_RESP; // keeping it same as that of
                                                 // normal logging
      low_touch_resp->status = M2M2_FILE_SYS_ERR_LOG_FORCE_STOPPED;
      //              file_sys_get_config_req->file_name = M2M2_PM_SYS_MCU_M3;
      post_office_send(response_mail, &err);
    }
  }
}

/*!
 ****************************************************************************
 * @brief   Sends the response of the low-touch commands to the tool if
 * registerd
 * @param    None
 * @retval   None
 ******************************************************************************/
static void SendLowTouchErrResp(M2M2_PM_SYS_STATUS_ENUM_t nStatus) {
  m2m2_hdr_t *response_mail = NULL;
  ADI_OSAL_STATUS err;

  if (low_touch_info.tool_addr != M2M2_ADDR_UNDEFINED) {
    response_mail =
        post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_cmd_t));
    if (response_mail != NULL) {
      m2m2_pm_sys_cmd_t *low_touch_resp =
          (m2m2_pm_sys_cmd_t *)&response_mail->data[0];

      /* send response packet */
      response_mail->src = M2M2_ADDR_SYS_PM;
      response_mail->dest = (M2M2_ADDR_ENUM_t)low_touch_info.tool_addr;
      response_mail->length = 10;
      response_mail->checksum = 0x0000;
      low_touch_resp->command =
          (low_touch_info.cmd +
              1); // response for the command sent from the tool
      low_touch_resp->status = nStatus;
      //              file_sys_get_config_req->file_name = M2M2_PM_SYS_MCU_M3;
      post_office_send(response_mail, &err);
    }
  }
}

/*!
 ****************************************************************************
 * @brief   Send m2m2 cmd to find config file REQ from NAND Flash
 * @param    None
 * @retval   None
 ******************************************************************************/
static void SendFindConfigFileReq() {
  m2m2_hdr_t *response_mail = NULL;
  ADI_OSAL_STATUS err;

  response_mail =
      post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_cmd_t));
  if (response_mail != NULL) {
    m2m2_file_sys_cmd_t *find_cfg_file_req =
        (m2m2_file_sys_cmd_t *)&response_mail->data[0];

    /* send response packet */
    response_mail->src = M2M2_ADDR_SYS_PM;
    response_mail->dest = M2M2_ADDR_SYS_FS;
    response_mail->length = 10;
    response_mail->checksum = 0x0000;
    find_cfg_file_req->command = M2M2_FILE_SYS_CMD_FIND_CONFIG_FILE_REQ;
    find_cfg_file_req->status = M2M2_APP_COMMON_STATUS_OK;
    //              file_sys_get_config_req->file_name = M2M2_PM_SYS_MCU_M3;
    post_office_send(response_mail, &err);
  }
}

/*!
 ****************************************************************************
 * @brief   Send m2m2 cmd to start read/download of config file from NAND Flash
 * @param    None
 * @retval   None
 ******************************************************************************/
static uint8_t ReadConfigFile() {
  m2m2_hdr_t *response_mail = NULL;
  ADI_OSAL_STATUS err;

  response_mail =
      post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_file_sys_get_req_t));
  if (response_mail != NULL) {
    m2m2_file_sys_get_req_t *file_sys_get_config_req =
        (m2m2_file_sys_get_req_t *)&response_mail->data[0];

    /* send response packet */
    response_mail->src = M2M2_ADDR_SYS_PM;
    response_mail->dest = M2M2_ADDR_SYS_FS;
    response_mail->length = 26;
    response_mail->checksum = 0x0000;
    file_sys_get_config_req->command = M2M2_FILE_SYS_CMD_DOWNLOAD_LOG_REQ;
    memcpy(&file_sys_get_config_req->file_name, ConfigFileName, 16);
    //              file_sys_get_config_req->file_name = M2M2_PM_SYS_MCU_M3;
    post_office_send(response_mail, &err);
  }
  return 0;
}

/*!
 ****************************************************************************
 * @brief   Function to handle MAX file error seen with LT logging
 * @param    None
 * @retval   None
 ******************************************************************************/
static void MaxFileErr() {
#ifdef ENABLE_WATCH_DISPLAY
  // Insert display code handling
  send_global_type_value(DIS_MAX_FILE_ALARM);//pop up max file error alam.
  resume_key_and_lt_task();
#endif
}

/*!
 ****************************************************************************
 * @brief   Function to indicate the error on any events of Low touch feature
 * @param    None
 * @retval   None
 ******************************************************************************/
void LowTouchErr(void) {
  //    gLowTouchRunning = 0;
#ifdef ENABLE_WATCH_DISPLAY
  // Insert display code handling
  send_global_type_value(DIS_LOW_TOUCH_ALARM);//pop up low touch alarm.
  resume_key_and_lt_task();
#endif
}

/* Debug variable to hold status of stream stop REQ */
uint8_t gs_in_prgrs_cnt = 0;
/*!
 ****************************************************************************
 * @brief   Function to validate the RESP command and status obtained after
 * running a m2m2 cmd from either the Start/Stop LT sequence
 * @param    src - The application address used to differentiate FS application
 * @param    nCommand-last command RESP received
 * @param    nStatus-status of last REQ cmd run
 * @retval   STATUS_VALID or STATUS_INVALID based on nStatus 
 ******************************************************************************/
static uint8_t ValidateStatus(M2M2_ADDR_ENUM_t  src, uint8_t nCommand, uint8_t nStatus) {
  uint8_t nStatusValid = STATUS_INVALID;

  switch (nCommand) {
  case M2M2_FILE_SYS_CMD_LOG_STREAM_REQ:
    if(M2M2_ADDR_SYS_FS == src)
    {
      gsSubStatusCnt++;
      nStatusValid = ((nStatus == M2M2_APP_COMMON_STATUS_SUBSCRIBER_ADDED))
                         ? STATUS_VALID
                         : STATUS_INVALID;
    }
    else
    {
      gsCommonStatusCnt++;
      nStatusValid = (nStatus == M2M2_APP_COMMON_STATUS_OK)? STATUS_VALID :
      STATUS_INVALID;
    }
    break;
  case M2M2_FILE_SYS_CMD_STOP_STREAM_REQ:
    if(M2M2_ADDR_SYS_FS == src)
    {
      gsSubStatusCnt++;
      nStatusValid =
          ((nStatus == M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED) ||
              (nStatus == M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT))
              ? STATUS_VALID
              : STATUS_INVALID;
    }
    else
    {
      gsCommonStatusCnt++;
      nStatusValid = (nStatus == M2M2_APP_COMMON_STATUS_OK)? STATUS_VALID :
      STATUS_INVALID;
    }
    break;
  case M2M2_APP_COMMON_CMD_STREAM_START_REQ:
    gsStartStatusCnt++;
    nStatusValid = ((nStatus == M2M2_APP_COMMON_STATUS_STREAM_STARTED) ||
                       (nStatus == M2M2_APP_COMMON_STATUS_OK) ||
                       (nStatus == M2M2_APP_COMMON_STATUS_STREAM_IN_PROGRESS))
                       ? STATUS_VALID
                       : STATUS_INVALID;
    break;
  case M2M2_APP_COMMON_CMD_STREAM_STOP_REQ:
    gsStartStatusCnt++;
    if (nStatus == M2M2_APP_COMMON_STATUS_STREAM_IN_PROGRESS) {
      nStatusValid = 1;
      gs_in_prgrs_cnt++;
    } else
      nStatusValid =
          ((nStatus == M2M2_APP_COMMON_STATUS_STREAM_STOPPED) ||
              (nStatus == M2M2_APP_COMMON_STATUS_STREAM_COUNT_DECREMENT) ||
              (nStatus == M2M2_APP_COMMON_STATUS_OK) ||
              (nStatus == M2M2_APP_COMMON_STATUS_STREAM_NOT_STARTED))
              ? STATUS_VALID
              : STATUS_INVALID;
    break;
  case M2M2_FILE_SYS_CMD_START_LOGGING_REQ:
    if(M2M2_ADDR_SYS_FS == src)
    {
      gsfslogStatusCnt++;
      nStatusValid = (nStatus == M2M2_FILE_SYS_STATUS_OK)
                         ? STATUS_VALID
                         : STATUS_INVALID; // M2M2_APP_COMMON_STATUS_OK
    }
    else
    {
      gsCommonStatusCnt++;
      nStatusValid = (nStatus == M2M2_APP_COMMON_STATUS_OK)? STATUS_VALID :
      STATUS_INVALID;
    }
    break;
  case M2M2_FILE_SYS_CMD_STOP_LOGGING_REQ:
    if(M2M2_ADDR_SYS_FS == src)
    {
      gsfslogStatusCnt++;
      nStatusValid = (nStatus == M2M2_FILE_SYS_STATUS_LOGGING_STOPPED)
                         ? STATUS_VALID
                         : STATUS_INVALID; // M2M2_APP_COMMON_STATUS_OK
    }
    else
    {
      gsCommonStatusCnt++;
      nStatusValid = (nStatus == M2M2_APP_COMMON_STATUS_OK)? STATUS_VALID :
      STATUS_INVALID;
    }
    break;
  default:
    gsCommonStatusCnt++;
    nStatusValid = STATUS_VALID;
    break;
  }

  NRF_LOG_INFO("Command = %x, Status valid flag=%d", nCommand, nStatusValid);
  return nStatusValid;
}

/*!
 ****************************************************************************
 * @brief   Function which forms a m2m2 cmd from Start/Stop LT sequence and
 * sends it out
 * @param    None
 * @retval   None
 ******************************************************************************/
static void SendUserConfigCommands(void) {
  m2m2_hdr_t *pkt = NULL;
  ADI_OSAL_STATUS err;

