ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
  /* Create system application thread */
  g_system_task_attributes.pThreadFunc = system_task;
  g_system_task_attributes.nPriority = APP_OS_CFG_PM_TASK_PRIO;
  g_system_task_attributes.pStackBase = &ga_system_task_stack[0];
  g_system_task_attributes.nStackSize = APP_OS_CFG_PM_TASK_STK_SIZE;
  g_system_task_attributes.pTaskAttrParam = NULL;
  g_system_task_attributes.szThreadName = "system_task";
  g_system_task_attributes.pThreadTcb = &g_system_task_tcb;
  eOsStatus = adi_osal_MsgQueueCreate(&gh_system_task_msg_queue, NULL, 9);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  } else {
    update_task_queue_list(APP_OS_CFG_SYS_TASK_INDEX, gh_system_task_msg_queue);
  }

  eOsStatus = adi_osal_ThreadCreateStatic(
      &gh_system_task_handler, &g_system_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }
  // adi_osal_SemCreate(&g_sys_task_evt_sem, 0);
  gsSensorAppsInfoHdr = (m2m2_hdr_t *)&gsSensorAppsInfoPkt[0];
  gsSensorAppsInfoPayload = (m2m2_pm_sys_sensor_apps_info_req_t *)&(
      gsSensorAppsInfoPkt[M2M2_HEADER_SZ]);
  gsSensorStatusRespPkt =
      (m2m2_pm_sys_sensor_apps_info_req_t *)gsSensorStatusPktBuf;

  battery_level_alerts.tool_addr = M2M2_ADDR_UNDEFINED;
  battery_level_alerts.level_low = DEFAULT_BATTERY_LEVEL_LOW;
  battery_level_alerts.level_critical = DEFAULT_BATTERY_LEVEL_CRITICAL;
  ping_timer_init();
}

uint32_t gPmMsgPostCnt = 0;
/*!
 ****************************************************************************
 * @brief  Function to send PO pkts to system task
 * @param  p_pkt m2m2 packet to be send to system task
 * @return None
 ******************************************************************************/
void send_message_system_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  osal_result = adi_osal_MsgQueuePost(gh_system_task_msg_queue, p_pkt);
  if (osal_result != ADI_OSAL_SUCCESS)
    post_office_consume_msg(p_pkt);
  else
    gPmMsgPostCnt++;
  // adi_osal_SemPost(g_sys_task_evt_sem);
}

#ifdef USE_FS
#ifdef FS_TEST_BLOCK_READ_DEBUG
uint8_t fs_task_read_tmp_blk_flag=0;
uint32_t page_num=0;
uint8_t type_arg;
uint32_t pdata_mem[10];
#endif
#endif

/*!
 ****************************************************************************
 * @brief  system_task - Get commands and response for system task APIs
 * @param  pArgument not used
 * @return None
 ******************************************************************************/
static void system_task(void *pArgument) {
  m2m2_hdr_t *pkt = NULL;
  _m2m2_app_common_cmd_t *ctrl_cmd = NULL;
  m2m2_hdr_t *response_mail = NULL;
  ADI_OSAL_STATUS err;

  /* Create a mailbox for Battery info stream */
  pkt = post_office_create_msg(M2M2_HEADER_SZ + sizeof(post_office_config_t));
  if (pkt != NULL) {
    post_office_config_t *payload = (post_office_config_t *)&pkt->data[0];
    pkt->src = M2M2_ADDR_SYS_PM;
    pkt->dest = M2M2_ADDR_POST_OFFICE;
    pkt->length = M2M2_HEADER_SZ + sizeof(post_office_config_t);

    payload->box = M2M2_ADDR_SYS_BATT_STREAM;
    payload->cmd = POST_OFFICE_CFG_CMD_ADD_MAILBOX;
    post_office_send(pkt, &err);
  }
  NRF_LOG_DEBUG("Entered System Application Task\n");

//  delete_low_touch_config_file();
//  load_default_low_touch_config();
#ifdef USE_FS
  // FindConfigFile(&gsCfgFileFoundFlag);
#endif // USE_FS
#ifdef LOW_TOUCH_FEATURE
#ifdef DCB
  find_low_touch_DCB();
#endif
#endif
  while (1) {
#ifdef USE_FS
#ifdef FS_TEST_BLOCK_READ_DEBUG
    if(fs_task_read_tmp_blk_flag)
    {
      read_tmp_blk(page_num,pdata_mem,type_arg);
      fs_task_read_tmp_blk_flag = 0;
    }
#endif
#endif
    pkt = post_office_get(5000, APP_OS_CFG_SYS_TASK_INDEX);
    // adi_osal_SemPend(g_sys_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
    // pkt = post_office_get(ADI_OSAL_TIMEOUT_FOREVER,
    // APP_OS_CFG_SYS_TASK_INDEX);
    if (pkt != NULL) {
      ctrl_cmd = (_m2m2_app_common_cmd_t *)&pkt->data[0];
      switch (ctrl_cmd->command) {
      case M2M2_APP_COMMON_CMD_GET_VERSION_REQ: {
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_app_common_version_t));
        if (response_mail != NULL) {
          uint8_t string_len = 0;
          m2m2_app_common_version_t *version_num_resp =
              (m2m2_app_common_version_t *)&response_mail->data[0];
          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          version_num_resp->command = M2M2_APP_COMMON_CMD_GET_VERSION_RESP;
          version_num_resp->major = FW_VERSION_MAJOR;
          version_num_resp->minor = FW_VERSION_MINOR;
          version_num_resp->patch = FW_VERSION_PATCH;
          memcpy(&version_num_resp->verstr[0], "-Perseus", 10);
          if (SYSTEM_BUILD_VERSION_LEN > sizeof(version_num_resp->str) - 1) {
            string_len = sizeof(version_num_resp->str) - 1;
          } else {
            string_len = SYSTEM_BUILD_VERSION_LEN;
          }

          memcpy(&version_num_resp->str[0], SYSTEM_BUILD_VERSION, string_len);

          if (SYSTEM_BUILD_VERSION_LEN + SYSTEM_BUILD_COMMIT_ID_LEN <
              sizeof(version_num_resp->str)) {
            version_num_resp->str[SYSTEM_BUILD_VERSION_LEN - 1] = '|';
            memcpy(&version_num_resp->str[SYSTEM_BUILD_VERSION_LEN],
                SYSTEM_BUILD_COMMIT_ID, SYSTEM_BUILD_COMMIT_ID_LEN);
          }
          if (SYSTEM_BUILD_VERSION_LEN + SYSTEM_BUILD_COMMIT_ID_LEN +
                  SYSTEM_BUILD_TIME_LEN <
              sizeof(version_num_resp->str)) {
            version_num_resp->str[SYSTEM_BUILD_VERSION_LEN +
                                  SYSTEM_BUILD_COMMIT_ID_LEN - 1] = '|';
            memcpy(&version_num_resp->str[SYSTEM_BUILD_VERSION_LEN +
                                          SYSTEM_BUILD_COMMIT_ID_LEN],
                SYSTEM_BUILD_TIME, SYSTEM_BUILD_TIME_LEN);
          }

          // NUL terminate string
          version_num_resp->str[sizeof(version_num_resp->str) - 1] = 0;
          NRF_LOG_INFO("GetVersion System Task Info");
          NRF_LOG_DEBUG("GetVersion System Task Debug");
          post_office_send(response_mail, &err);
        }

