ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
        ping_timer_start();
        ping_count = ctrl1->sequence_num;
        ping_pkt_sz = pkt->length;
        ping_pkt_src = pkt->src;

        post_office_consume_msg(pkt);

        break;
      }
      case M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_REQ: {
        BattInfoSubsciberCount++;
        /* Subscribe for Mailbox */
        m2m2_hdr_t *sub_pkt = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(post_office_config_t));
        if (sub_pkt != NULL) {
          post_office_config_t *payload =
              (post_office_config_t *)&sub_pkt->data;
          payload->cmd = POST_OFFICE_CFG_CMD_MAILBOX_SUBSCRIBE;
          payload->sub = pkt->src;
          payload->box = M2M2_ADDR_SYS_BATT_STREAM;

          sub_pkt->src = pkt->dest;
          sub_pkt->dest = M2M2_ADDR_POST_OFFICE;
          post_office_send(sub_pkt, &err);
        }

        /* Send Response packet */
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_app_common_sub_op_t));
        if (response_mail != NULL) {
          m2m2_app_common_sub_op_t *resp_payload =
              (m2m2_app_common_sub_op_t *)&response_mail->data;
          resp_payload->command = M2M2_APP_COMMON_CMD_STREAM_SUBSCRIBE_RESP;
          resp_payload->status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_ADDED;
          resp_payload->stream = M2M2_ADDR_SYS_BATT_STREAM;
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          post_office_send(response_mail, &err);
        }

        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_REQ: {
        /* UnSubscribe for Mailbox */
        m2m2_hdr_t *sub_pkt = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(post_office_config_t));
        if (sub_pkt != NULL) {
          post_office_config_t *payload =
              (post_office_config_t *)&sub_pkt->data;
          payload->cmd = POST_OFFICE_CFG_CMD_MAILBOX_UNSUBSCRIBE;
          payload->sub = pkt->src;
          payload->box = M2M2_ADDR_SYS_BATT_STREAM;

          sub_pkt->src = pkt->dest;
          sub_pkt->dest = M2M2_ADDR_POST_OFFICE;
          post_office_send(sub_pkt, &err);
        }

        /* Send Response packet */
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_app_common_sub_op_t));
        if (response_mail != NULL) {
          m2m2_app_common_sub_op_t *resp_payload =
              (m2m2_app_common_sub_op_t *)&response_mail->data;
          resp_payload->command = M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_RESP;

          if (BattInfoSubsciberCount <= 1) {
            BattInfoSubsciberCount = 0;
            resp_payload->status = M2M2_APP_COMMON_STATUS_SUBSCRIBER_REMOVED;
          } else {
            BattInfoSubsciberCount--;
            resp_payload->status =
                M2M2_APP_COMMON_STATUS_SUBSCRIBER_COUNT_DECREMENT;
          }
          resp_payload->stream = M2M2_ADDR_SYS_BATT_STREAM;
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          post_office_send(response_mail, &err);
        }

        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_GET_DATE_TIME_REQ: {
        M2M2_PM_SYS_STATUS_ENUM_t status = M2M2_PM_SYS_STATUS_ERR_NOT_CHKD;
        m_time_struct *local_get_date_time;

        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_date_time_req_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_date_time_req_t *date_time_resp =
              (m2m2_pm_sys_date_time_req_t *)&response_mail->data[0];
          time_t return_time;
          int16_t timezone_offset;

          get_log_time_stamp(&return_time, &timezone_offset);
          local_get_date_time = m_sec_to_date_time(
              return_time + timezone_offset); // For file getDateTime
                                              // timezone_offset IS required

          status = (M2M2_PM_SYS_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;
          date_time_resp->year = local_get_date_time->tm_year;
          date_time_resp->month = local_get_date_time->tm_mon;
          date_time_resp->day = local_get_date_time->tm_mday;
          date_time_resp->hour = local_get_date_time->tm_hour;
          date_time_resp->minute = local_get_date_time->tm_min;
          date_time_resp->second = local_get_date_time->tm_sec;
          date_time_resp->TZ_sec = timezone_offset;

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          date_time_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)
              M2M2_PM_SYS_COMMAND_GET_DATE_TIME_RESP;
          date_time_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)status;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_SET_DATE_TIME_REQ : {
        m_time_struct set_date_time;
        uint32_t nTimeInSec;
        m2m2_pm_sys_date_time_req_t *date_time =
            (m2m2_pm_sys_date_time_req_t *)&pkt->data[0];

        set_date_time.tm_year = date_time->year;
        set_date_time.tm_mon = date_time->month;
        set_date_time.tm_mday = date_time->day;
        set_date_time.tm_hour = date_time->hour;
        set_date_time.tm_min = date_time->minute;
        set_date_time.tm_sec = date_time->second;

        nTimeInSec = m_date_time_to_sec(&set_date_time);

        M2M2_PM_SYS_STATUS_ENUM_t status;
        status = (M2M2_PM_SYS_STATUS_ENUM_t)M2M2_APP_COMMON_STATUS_OK;

        int32_t tz_value;

        tz_value = date_time->TZ_sec;
        rtc_timestamp_set(nTimeInSec - tz_value);
        rtc_timezone_set(tz_value);
#ifdef ENABLE_WATCH_DISPLAY
        send_private_type_value(DIS_REFRESH_SIGNAL);
#endif
        StreamBatt_Info();
        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
        if (response_mail != NULL) {
          _m2m2_app_common_cmd_t *date_time_resp =
              (_m2m2_app_common_cmd_t *)&response_mail->data[0];

          /* send response packet */
          response_mail->src = pkt->dest;
          response_mail->dest = pkt->src;
          date_time_resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)
              M2M2_PM_SYS_COMMAND_SET_DATE_TIME_RESP;
          date_time_resp->status = (M2M2_APP_COMMON_STATUS_ENUM_t)status;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_SET_MANUFACTURE_DATE_REQ: {
        manufacture_date_t date;

