ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/system/system_task.c
          if (gLowTouchRunning)
            low_touch_resp->status =
                M2M2_PM_SYS_STATUS_LOW_TOUCH_LOGGING_IN_PROGRESS;
          else
            low_touch_resp->status =
                M2M2_PM_SYS_STATUS_LOW_TOUCH_LOGGING_NOT_STARTED;

          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_PM_SYS_COMMAND_ACTIVATE_TOUCH_SENSOR_REQ: {

        uint8_t ret_val;
        if (gen_blk_get_dcb_present_flag() || gsCfgFileFoundFlag)
        {
          ret_val =
              EnableLowTouchDetection(true); // enable  the low touch detection mechanism
        }
        else
        {
          //No LT config file
          ret_val = 1;//Error
        }
        response_mail =
            post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_cmd_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_cmd_t *resp =
              (m2m2_pm_sys_cmd_t *)&response_mail->data[0];

          /*Send the response*/
          response_mail->dest = pkt->src;
          response_mail->src = pkt->dest;

          resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)
              M2M2_PM_SYS_COMMAND_ACTIVATE_TOUCH_SENSOR_RESP;
          resp->status =
              (ret_val == 0)
                  ? (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_OK
                  : (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_ERR_ARGS;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }

      case M2M2_PM_SYS_COMMAND_DEACTIVATE_TOUCH_SENSOR_REQ: {

        uint8_t ret_val;
        ret_val = EnableLowTouchDetection(false); // disable  the low touch detection
                                           // mechanism
        response_mail =
            post_office_create_msg(M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_cmd_t));
        if (response_mail != NULL) {
          m2m2_pm_sys_cmd_t *resp =
              (m2m2_pm_sys_cmd_t *)&response_mail->data[0];

          /*Send the response*/
          response_mail->dest = pkt->src;
          response_mail->src = pkt->dest;
          resp->command = (M2M2_APP_COMMON_CMD_ENUM_t)
              M2M2_PM_SYS_COMMAND_DEACTIVATE_TOUCH_SENSOR_RESP;
          resp->status =
              (ret_val == 0)
                  ? (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_OK
                  : (M2M2_APP_COMMON_STATUS_ENUM_t)M2M2_PM_SYS_STATUS_ERR_ARGS;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
#endif // LOW_TOUCH_FEATURE

      case M2M2_PM_SYS_COMMAND_FORCE_STREAM_STOP_REQ: {
        gnForceStopReqAddr = pkt->src; // Update from which src Force stop
                                       // Request was received(ble/usb)
        // Force-stop Sensor streaming that wasn't stopped
        SendForceStopStreaming();
        post_office_consume_msg(pkt);
        break;
      }
#ifdef DCB
      case M2M2_DCB_COMMAND_QUERY_STATUS_REQ: {

        response_mail = post_office_create_msg(
            M2M2_HEADER_SZ + sizeof(m2m2_dcb_block_status_t));
        if (response_mail != NULL) {
          m2m2_dcb_block_status_t *resp =
              (m2m2_dcb_block_status_t *)&response_mail->data[0];

          memset(resp->dcb_blk_array, 0, sizeof(resp->dcb_blk_array));

          // Query & Fill in the DCB Block status currently in the firmware
#ifdef LOW_TOUCH_FEATURE
          resp->dcb_blk_array[ADI_DCB_GENERAL_BLOCK_IDX] =
              gen_blk_get_dcb_present_flag();
          resp->dcb_blk_array[ADI_DCB_LT_APP_LCFG_BLOCK_IDX] =
              lt_app_lcfg_get_dcb_present_flag();
#endif
          resp->dcb_blk_array[ADI_DCB_ADPD4000_BLOCK_IDX] =
              adpd4000_get_dcb_present_flag();
          resp->dcb_blk_array[ADI_DCB_ADXL362_BLOCK_IDX] =
              adxl_get_dcb_present_flag();
#ifdef ENABLE_PPG_APP
          resp->dcb_blk_array[ADI_DCB_PPG_BLOCK_IDX] =
              ppg_get_dcb_present_flag();
#endif
#ifdef ENABLE_ECG_APP
          resp->dcb_blk_array[ADI_DCB_ECG_BLOCK_IDX] =
              ecg_get_dcb_present_flag();
#endif
#ifdef ENABLE_EDA_APP
          resp->dcb_blk_array[ADI_DCB_EDA_BLOCK_IDX] =
              eda_get_dcb_present_flag();
#endif
#ifdef ENABLE_BCM_APP
          resp->dcb_blk_array[ADI_DCB_BCM_BLOCK_IDX] =
              bcm_get_dcb_present_flag();
#endif
          resp->dcb_blk_array[ADI_DCB_AD7156_BLOCK_IDX] =
              ad7156_get_dcb_present_flag();

          /*Send the response*/
          response_mail->dest = pkt->src;
          response_mail->src = pkt->dest;
          resp->command =
              (M2M2_DCB_COMMAND_ENUM_t)M2M2_DCB_COMMAND_QUERY_STATUS_RESP;
          resp->status =
              M2M2_PM_SYS_STATUS_OK;
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
#ifdef LOW_TOUCH_FEATURE
      case M2M2_DCB_COMMAND_READ_CONFIG_REQ: {

        response_mail = lt_app_lcfg_dcb_command_read_config(pkt);
        if (response_mail != NULL) {
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_DCB_COMMAND_WRITE_CONFIG_REQ: {

        response_mail = lt_app_lcfg_dcb_command_write_config(pkt);
        if (response_mail != NULL) {
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
      case M2M2_DCB_COMMAND_ERASE_CONFIG_REQ: {

        response_mail = lt_app_lcfg_dcb_command_delete_config(pkt);
        if (response_mail != NULL) {
          post_office_send(response_mail, &err);
        }
        post_office_consume_msg(pkt);
        break;
      }
#endif//LOW_TOUCH_FEATURE
#endif

      /* Insert new cases to be handled above this comment line */

      case M2M2_APP_COMMON_CMD_STREAM_STOP_RESP: {
        gsSensorStopCnt++; // Increment the number of stop commands sent
        if (gb_sensor_stop_cmds) {
          gb_stop_streaming_if_no_logging = 1;
          gb_sensor_stop_cmds = 0;
          SendSensorStopCmds(); // Send Next stop command
          post_office_consume_msg(pkt);
          break;
        } else
          ; // break;//intentionally commented out to let the default case for
            // LT execute
      }
      case M2M2_APP_COMMON_CMD_STREAM_UNSUBSCRIBE_RESP: {
        gsSensorSubCnt++; // Increment the number of unsub commands sent
        if (gb_sensor_stop_cmds) {
          gb_stop_streaming_if_no_logging = 1;
          if (gb_unsub_only) {
            gb_unsub_only = 0;
            gb_sensor_stop_cmds = 0;
            SendSensorStopCmds(); // Send Next stop command
          }
          post_office_consume_msg(pkt);
          break;
        } else
          ; // break;//intentionally commented out to let the default case for
            // LT execute
      }
      /* Add new cases to be handled above the case for
         M2M2_APP_COMMON_CMD_STREAM_STOP_RESP */
      default: {
#ifdef LOW_TOUCH_FEATURE
        // if(0x28 != ctrl_cmd->command)
        //  NRF_LOG_INFO("Received cmd:%x",ctrl_cmd->command);
        if (ctrl_cmd->command == (gsConfigCtrl->command + 1)) {
          gsSendNextConfigCmd = ValidateStatus(pkt->src, gsConfigCtrl->command,
              ctrl_cmd->status); // Check the status of the response pkt
              /* TODO:  This block is commented out, as as ValidateStatus()
                was not handling command REQ cases which were having same values
                for eg: M2M2_FILE_SYS_CMD_START_LOGGING_REQ =
                M2M2_SENSOR_ADPD_COMMAND_AGC_ON_OFF_REQ = 118.
                We would need to do better handling here and enable check of the
                return value of ValidateStatus() api.*/
              if(!gsSendNextConfigCmd)
              {
                  gsCmdRetryCnt++;            //Increment the Retry count
                  gsSendNextConfigCmd = 1;    // previous command will be sent again; as Config file read ptr is not updated

                  if(gsCmdRetryCnt >= MAX_CMD_RETRY_CNT)      //If retry count reaches its max limit goto the next command in the config file
                  {
                      gsConfigFileReadPtr += gsPktLenCopy;    // Update the Config file read ptr to next command
                      gsCmdRetryCnt = 0;                      //TODO: Intimate  missing cmd to the user
                      if(gsStartCmdsRunning)
                      {
                        if(gbDCBCfgFoundFlag)
                          SendLowTouchErrResp(M2M2_PM_SYS_STATUS_ENABLE_DCB_CONFIG_LOG_FAILED);
                        else
                          SendLowTouchErrResp(M2M2_PM_SYS_STATUS_ENABLE_USER_CONFIG_LOG_FAILED);
                      }
                      else
                      {
                        if(gbDCBCfgFoundFlag)
                          SendLowTouchErrResp(M2M2_PM_SYS_STATUS_DISABLE_DCB_CONFIG_LOG_FAILED);
                        else
                          SendLowTouchErrResp(M2M2_PM_SYS_STATUS_DISABLE_USER_CONFIG_LOG_FAILED);
                      }
                      LowTouchErr();
                      post_office_consume_msg(pkt);
                      break;      //skip sending the further command
                  }
              }
              else
              {
          gsCmdRetryCnt = 0;
          gsNumOfCommands++; // Command is properly being sent and ackd
          gsConfigFileReadPtr +=
              gsPktLenCopy; // Update the Config file read ptr to next command
          }
          if ((gsStartCmdsRunning) &&
              (gsCfgFileSummaryPkt->start_cmd_cnt == gsNumOfCommands)) {
            gsStartCmdsRunning = 0;
            gLowTouchRunning = 1; // Low touch logging has started
#ifdef DCB
            if (!gbDCBCfgFoundFlag) {
#endif
              SendLowTouchErrResp(M2M2_PM_SYS_STATUS_USER_CONFIG_LOG_ENABLED);
#ifdef DCB
            } else
              SendLowTouchErrResp(M2M2_PM_SYS_STATUS_DCB_CONFIG_LOG_ENABLED);
#endif
              if(!get_low_touch_trigger_mode2_status())
              {
                //Check if OFFWrist event had come in b/w start cmd seq execution
                if(eCurDetection_State == OFF_WRIST)
                {
                  InitConfigParam(0);
                  SendUserConfigCommands();
                  gLowTouchRunning = 0;
                }
              }
          } else if ((gsStopCmdsRunning) &&
                     (gsCfgFileSummaryPkt->stop_cmd_cnt == gsNumOfCommands)) {
            gsStopCmdsRunning = 0;
            SetCfgCopyAvailableFlag(
                true); /*update the config file copy availability flag*/
            gLowTouchRunning = 0; // Low Touch loggging has stopped
#ifdef DCB
            if (!gbDCBCfgFoundFlag) {
#endif
              SendLowTouchErrResp(M2M2_PM_SYS_STATUS_USER_CONFIG_LOG_DISABLED);
#ifdef DCB
            } else
              SendLowTouchErrResp(M2M2_PM_SYS_STATUS_DCB_CONFIG_LOG_DISABLED);
#endif
          } else {
            SendUserConfigCommands();
          }
        }
#endif // LOW_TOUCH_FEATURE
        post_office_consume_msg(pkt);
        break;
      } // end of default
      } // end of switch
    }   /*if(pkt != NULL)*/
    else {
      StreamBatt_Info();
    } // end of else, for if(pkt != NULL)*/
  }
}

/**
 * @brief  StreamBatt_Info - Gets Battery info from ADP5360 and streams to
 * subscribers
 * @param  pArgument not used
 * @return None
 */
void StreamBatt_Info(void) {
  m2m2_hdr_t *pkt = NULL;
  ADI_OSAL_STATUS err;
  BATTERY_STATUS_t bat_status;
  M2M2_PM_SYS_BAT_STATE_ENUM_t enBatstatus = M2M2_PM_SYS_BAT_STATE_CHARGE_ERR;
  PWR_CTRL_STATUS_t pwr_err;
  ADP5360_RESULT ret;
  static uint8_t ble_bas_timer_cnt = 0;
  // uint16_t nGpioVal;

  // adi_gpio_GetData(ADI_GPIO_PORT1, ADI_GPIO_PIN_1, &nGpioVal);
  /* Read Battery Info */
  ret = Adp5360_get_battery_details(&bat_status);
  pwr_err = (!ret) ? PWR_CTRL_ERROR : PWR_CTRL_SUCCESS;
  if (pwr_err != PWR_CTRL_ERROR /* && nGpioVal != 0*/) {
    /* Set the battery voltage, temperature and status */
    switch (bat_status.chrg_status) {
    case BATTERY_NOT_AVAILABLE: {
      enBatstatus = M2M2_PM_SYS_BAT_STATE_NOT_AVAIL;
      break;
    }
    case BATTERY_CHARGING:
    case BATTERY_CHARGER_LDO_MODE:
    case BATTERY_CHARGER_TIMER_EXPIRED: {
      enBatstatus = M2M2_PM_SYS_BAT_STATE_CHARGING;
      break;
    }
    case BATTERY_CHARGE_COMPLETE: {
      enBatstatus = M2M2_PM_SYS_BAT_STATE_COMPLETE;
      break;
    }
    case BATTERY_NOT_CHARGING: {
      enBatstatus = M2M2_PM_SYS_BAT_STATE_NOT_CHARGING;
#ifdef USE_FS
      if (bat_status.level <= ADI_PM_BAT_LEVEL_LOG_CRITICAL) {
        battery_level_alerts.critical_level_flag = 1; /*Critical Battery level for logging*/
        /* If File logging is in progress */
        if (fs_hal_write_access_state() == FS_FILE_ACCESS_IN_PROGRESS) {
          /* Force Stop Logging */
          pkt = post_office_create_msg(
              M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));
          if (pkt != NULL) {
            _m2m2_app_common_cmd_t *payload =
                (_m2m2_app_common_cmd_t *)&pkt->data[0];
            payload->command = (M2M2_APP_COMMON_CMD_ENUM_t)
                M2M2_FILE_SYS_CMD_FORCE_STOP_LOG_REQ;
            pkt->src = M2M2_ADDR_SYS_PM;
            pkt->dest = M2M2_ADDR_SYS_FS;
            post_office_send(pkt, &err);
          }
        }
      }
#endif
      if (bat_status.level <= battery_level_alerts.level_critical) {
        // TODO: Insert display code handling
        SendBatteryLevelAlertMsg(M2M2_PM_SYS_STATUS_BATTERY_LEVEL_CRITICAL);

      } else if (bat_status.level <= battery_level_alerts.level_low) {
        // TODO: Insert display code handling
        SendBatteryLevelAlertMsg(M2M2_PM_SYS_STATUS_BATTERY_LEVEL_LOW);
      } else {
        // No need to handle
      }
      break;
    }
    case BATTERY_DETECTION: {
      enBatstatus = M2M2_PM_SYS_BAT_STATE_DETECTION;
      break;
    }
    case BATTERY_UNKNOWN:
    default: {
      enBatstatus = M2M2_PM_SYS_BAT_STATE_CHARGE_ERR;
      // TODO: Insert display code handling
      break;
    }
    }
  }
  /* Send Battery info as Stream to subscribers */
  if (BattInfoSubsciberCount > 0) {
    pkt = post_office_create_msg(
        M2M2_HEADER_SZ + sizeof(m2m2_pm_sys_bat_info_resp_t));
    if (pkt != NULL) {
      m2m2_pm_sys_bat_info_resp_t *payload =
          (m2m2_pm_sys_bat_info_resp_t *)&pkt->data[0];
      payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_SENSOR_COMMON_CMD_STREAM_DATA;

      /* Set the status for stream packet */
      if (pwr_err) {
        payload->status = M2M2_APP_COMMON_STATUS_ERROR;
      } else {
        payload->status = M2M2_APP_COMMON_STATUS_OK;
      }
      payload->bat_chrg_stat = enBatstatus;
      payload->bat_mv = bat_status.voltage_mv;
      payload->bat_lvl = bat_status.level;
      time_t return_time;
      int16_t timezone_offset;
      get_log_time_stamp(&return_time, &timezone_offset);
      payload->timestamp = return_time + timezone_offset;
      pkt->checksum = BattInfoChecksum++;
      pkt->src = M2M2_ADDR_SYS_PM;
      pkt->dest = M2M2_ADDR_SYS_BATT_STREAM;
      post_office_send(pkt, &err);
    }
  }
  if( get_ble_nus_status() == BLE_CONNECTED )
  {
    if(++ble_bas_timer_cnt == 2)
    {
      ble_bas_timer_cnt = 0;

      battery_level_update();
    }
  }
  else
    ble_bas_timer_cnt = 0;
}

/////////////////////////////////////////////////////////////////////////
#define PING_DATA_TX_INTERVAL                                                  \
  20 /**< Ping Data transmitted interval 20 (ms).  \ \                                                                             \
      */

APP_TIMER_DEF(m_ping_timer_id); /**< Handler for repeated timer for ping. */

/*!
 ****************************************************************************
 *@brief Function for handling the PING DATA TX timer time-out.
 *
 * @details This function will be called each time the ping data transmit timer
 * expires.
 ******************************************************************************/
static void ping_data_tx_timeout_handler(void *p_context) {
  m2m2_hdr_t *response_mail = NULL;
  ADI_OSAL_STATUS err;
  static uint16_t seq_no = 0;

  NRF_LOG_INFO("Ping Timer expiry ping_count:%d, pkt_sz:%d", seq_no, ping_pkt_sz);
  // response_mail = post_office_create_msg(M2M2_HEADER_SZ +
  // sizeof(m2m2_app_common_ping_t));
  response_mail = post_office_create_msg(ping_pkt_sz);
  if (response_mail != NULL) {
    m2m2_app_common_ping_t *ctrl =
        (m2m2_app_common_ping_t *)&response_mail->data[0];
    response_mail->dest = ping_pkt_src;
    response_mail->src = M2M2_ADDR_SYS_PM;
    response_mail->length = ping_pkt_sz;
    ctrl->command = M2M2_APP_COMMON_CMD_PING_RESP;
    ctrl->status = M2M2_OK;
    ctrl->sequence_num = ++seq_no;
    post_office_send(response_mail, &err);
    if (--ping_count == 0) {
      seq_no = 0;
      ping_timer_stop();
    }
  }
}

/*!
 ****************************************************************************
 *@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application
 * timers.
 ******************************************************************************/
static void ping_timer_init(void) {
  ret_code_t err_code;

  // Create timers
  err_code = app_timer_create(&m_ping_timer_id, APP_TIMER_MODE_REPEATED, ping_data_tx_timeout_handler);

  APP_ERROR_CHECK(err_code);
}

/*!
 ****************************************************************************
 *@brief   Function for starting application timers.
 * @details Timers are run after the scheduler has started.
 * @param   None
 * @retval   None
 ******************************************************************************/
static void ping_timer_start(void) {
  /* Start repeated timer */
  ret_code_t err_code = app_timer_start(m_ping_timer_id, APP_TIMER_TICKS(PING_DATA_TX_INTERVAL), NULL);
  APP_ERROR_CHECK(err_code);
}

/*!
 ****************************************************************************
 *@brief   Function for stopping application timers.
 * @param   None
 * @retval   None
 ******************************************************************************/
static void ping_timer_stop(void) {
  /* Stop the repeated timer */
  ret_code_t err_code = app_timer_stop(m_ping_timer_id);
  APP_ERROR_CHECK(err_code);
}

